STATISTICAL_REPORT_EXISTS_MESSAGE = 'Статистический отчет для данного РШ уже существует'
REPORT_EXISTS_MESSAGE = 'Отчет для данного показателя уже существует'
REPORT_SENT_MESSAGE = 'Нельзя редактировать отправленный на верификацию отчет'

# Должности экспертов
DISTRICT_EXPERT_POSITION = 'Эксперт ОШ'
CENTRAL_EXPERT_POSITION = 'Эксперт ЦШ'

R6_DATA = [
    ({1: "III Международный строительный чемпионат"}, {"month": "октябрь"}, {"city": "Санкт-Петербург"}),
    ({2: "Образовательный семинар для вожатых студенческих педагогических отрядов"}, {"month": "октябрь"}, {"city": "Пятигорск"}),
    ({3: "Всероссийский форум студенческих педагогических отрядов «Вожатская смена: новая высота!»"}, {"month": "октябрь"}, {"city": "Барнаул"}),
    ({4: "Всероссийская профориентационная смена «Труд крут»"}, {"month": "ноябрь"}, {"city": "Анапа"}),
    ({5: "Всероссийский Слет студенческих отрядов"}, {"month": "ноябрь"}, {"city": "Казань"}),
    ({6: "Всероссийский конкурс профессионального мастерства «Труд крут» по девяти направлениям деятельности"}, {"month": "ноябрь"}, {"city": "Казань"}),
    ({7: "Всероссийская спартакиада студенческих отрядов"}, {"month": "ноябрь"}, {"city": "Казань"}),
    ({8: "Всероссийский слет студенческих отрядов образовательных организаций аграрного профиля Российской Федерации «Студагро»"}, {"month": "ноябрь"}, {"city": "Барнаул"}),
    ({9: "Всероссийский слёт студенческих отрядов проводников"}, {"month": "ноябрь"}, {"city": "Новосибирск"}),
    ({10: "Всероссийский интенсив сервисного направления"}, {"month": "ноябрь"}, {"city": "Челябинск"}),
    ({11: "Всероссийский медицинский карьерный форум «Труд крут»"}, {"month": "декабрь"}, {"city": "Южно-Сахалинск"}),
    ({12: "Всероссийское совещание руководителей направлений студенческих отрядов проводников"}, {"month": "февраль"}, {"city": "Самара"}),
    ({13: "Карьерный форум «Труд крут»"}, {"month": "февраль"}, {"city": "Москва"}),
    ({14: "Всероссийский форум участников патриотической акции «Снежный десант РСО»"}, {"month": "февраль"}, {"city": "Архангельск"}),
    ({15: "Всероссийское совещание руководителей направления производственных отрядов"}, {"month": "март"}, {"city": "Республика Татарстан"}),
    ({16: "Школа инструкторов Всероссийского студенческого отряда проводников"}, {"month": "март"}, {"city": "Иркутск"}),
    ({17: "Школа командиров и комиссаров студенческих отрядов железнодорожного транспорта"}, {"month": "март"}, {"city": "Иркутск"}),
    ({18: "Всероссийское совещание руководителей региональных штабов МООО «РСО»"}, {"month": "март"}, {"city": "Иркутск"}),
    ({19: "Школа методистов студенческих педагогических отрядов «СПОсобность к действию»"}, {"month": "март"}, {"city": "Пермь"}),
    ({20: "Всероссийское совещание руководителей сервисного направления"}, {"month": "март"}, {"city": "Великий Новгород"}),
    ({21: "Всероссийский медицинский карьерный форум «Труд крут»"}, {"month": "март"}, {"city": "Пермь"}),
    ({22: "Всероссийское совещание руководителей направлений студенческих педагогических отрядов региональных отделений"}, {"month": "март"}, {"city": "Самара"}),
    ({23: "Всероссийский форум студенческих строительных отрядов и Всероссийское совещание руководителей ССО"}, {"month": "март"}, {"city": "Нижний Новгород"}),
    ({24: "Школа инструкторов Всероссийского студенческого отряда проводников"}, {"month": "март"}, {"city": "Ижевск"}),
    ({25: "Всероссийский форум путинных отрядов"}, {"month": "март-апрель"}, {"city": "Южно-Сахалинск"}),
    ({26: "Всероссийское совещание для руководителей сельскохозяйственного направления региональных штабов РСО и руководителей штабов аграрных вузов России"}, {"month": "апрель"}, {"city": "Пермь"}),
    ({27: "Всероссийское совещание-обучение руководителей направления трудовых отрядов подростков"}, {"month": "апрель"}, {"city": "Пермь"}),
    ({28: "Всероссийский экологический форум студенческих отрядов «ЭкоТОП»"}, {"month": "апрель"}, {"city": "Республика Крым"}),
    ({29: "Всероссийская школа подготовки командных составов штабов Всероссийских трудовых проектов"}, {"month": "апрель"}, {"city": "Москва"}),
    ({30: "Интенсив Корпоративного университета РСО"}, {"month": "май"}, {"city": "Московская область"}),
    ({31: "Всероссийский форум специализированных и производственных отрядов «Работа молодым»"}, {"month": "апрель"}, {"city": "Республика Татарстан"}),
    ({32: "Проведение Всероссийского урока труда"}, {"month": "апрель"}, {"city": "регионы"}),
    ({33: "Неделя охраны труда РСО"}, {"month": "апрель"}, {"city": "регионы"}),
    ({34: "Всероссийская школа подготовки руководителей региональных штабов студенческих отрядов – Вышка РСО"}, {"month": "апрель"}, {"city": "Москва"}),
    ({35: "Всероссийская школа по подготовке руководителей сервисных отрядов"}, {"month": "апрель"}, {"city": "Севастополь"}),
    ({36: "Тематическое шествие «Май! Труд крут!»"}, {"month": "май"}, {"city": "Москва"}),
    ({37: "Всероссийская трудовая акция «Труд крут»"}, {"month": "апрель-май"}, {"city": "регионы"}),
    ({38: "Всероссийский образовательный семинар в рамках Молодёжного форума «Алтай: Территория Развития»"}, {"month": "май"}, {"city": "Белокуриха"}),
    ({39: "Школа командиров и комиссаров студенческих строительных отрядов атомной отрасли"}, {"month": "май"}, {"city": "Нижний Новгород"}),
    ({40: "Школа командиров и комиссаров студенческих отрядов электросетевого комплекса"}, {"month": "май"}, {"city": "онлайн"}),
    ({41: "Школа командиров и комиссаров студенческих отрядов публичного акционерного общества «Газпром»"}, {"month": "июнь"}, {"city": "Санкт-Петербург"}),
    ({42: "Открытие Всероссийского летнего трудового семестра студенческих отрядов железнодорожного транспорта"}, {"month": "июнь"}, {"city": "Москва"}),
    ({43: "Всероссийское открытие трудового семестра студенческих медицинских отрядов МООО «РСО»"}, {"month": "июль"}, {"city": "Москва"}),
    ({44: "II Всероссийский слет ветеранов студенческих отрядов"}, {"month": "июль"}, {"city": "Архангельск"}),
    ({45: "Всероссийский молодёжный форум «Машук», трек «Дружба»"}, {"month": "август"}, {"city": "Пятигорск"}),
    ({46: "Всероссийский интенсив для руководителей региональных отделений Российских студенческих отрядов"}, {"month": "сентябрь"}, {"city": "Нижнекамск"}),
    ({47: "Всероссийский слет трудовых отрядов подростков"}, {"month": "сентябрь"}, {"city": "Архангельск"}),
    ({48: "Всероссийская смена студенческих сельскохозяйственных отрядов в рамках Всероссийского форума «Ростов»"}, {"month": "сентябрь"}, {"city": "Ростовская область"}),
    ({49: "Всероссийская медиашкола Российских студенческих отрядов"}, {"month": "сентябрь"}, {"city": "Красноярск"}),
    ({50: "Всероссийская медиашкола Российских студенческих отрядов"}, {"month": "сентябрь"}, {"city": "Московская область"}),
    ({51: "Всероссийский слет студенческих отрядов нефтедобывающей отрасли"}, {"month": "сентябрь"}, {"city": "Альметьевск"}),
    ({52: "Цифровой прорыв. Сезон: Искусственный интеллект"}, {"month": "сентябрь"}, {"city": "онлайн"}),
    ({53: "ВСПрО «КАМАЗ»"}, {"month": None}, {"city": None}),
    ({54: "ВСС «Мирный атом»"}, {"month": None}, {"city": None}),
    ({55: "ВСС «Мирный атом-ПРОРЫВ»"}, {"month": None}, {"city": None}),
    ({56: "ВСС «Мирный атом-ЛАЭС»"}, {"month": None}, {"city": None}),
    ({57: "ВСС «СКИФ»"}, {"month": None}, {"city": None}),
    ({58: "ВСС «Север»"}, {"month": None}, {"city": None}),
    ({59: "ВСС «Сибирь»"}, {"month": None}, {"city": None}),
    ({60: "ВСС «БАМ 2.0»"}, {"month": None}, {"city": None}),
    ({61: "ВСПО «Артек»"}, {"month": None}, {"city": None}),
    ({62: "ВСПО «Дельфин.ru»"}, {"month": None}, {"city": None}),
    ({63: "ВСПО «Гагарин»"}, {"month": None}, {"city": None}),
    ({64: "ВСПО «Океан»"}, {"month": None}, {"city": None}),
    ({65: "ВСПО «Орлёнок»"}, {"month": None}, {"city": None}),
    ({66: "ВСПО «Сириус»"}, {"month": None}, {"city": None}),
    ({67: "ВСССхО «Агроном-сад»"}, {"month": None}, {"city": None}),
    ({68: "ВССхО «МоСт» (Молочный стандарт)"}, {"month": None}, {"city": None}),
    ({69: "ВССПуО «Край Света»"}, {"month": None}, {"city": None}),
    ({70: "ВСССервО «Мрия»"}, {"month": None}, {"city": None}),
    ({71: "ВСССервО «Метрополь»"}, {"month": None}, {"city": None}),
    ({72: "ВСССервО «Сочи Парк Отель»"}, {"month": None}, {"city": None}),
    ({73: "ВСССервО «Взлетная полоса»"}, {"month": None}, {"city": None}),
    ({74: "ВСССервО «Последний рассвет»"}, {"month": None}, {"city": None}),
    ({75: "ВСМО «Атлант»"}, {"month": None}, {"city": None}),
    ({76: "ВСМО «Академия»"}, {"month": None}, {"city": None}),
    ({77: "ВСМО «Аметист»"}, {"month": None}, {"city": None}),
    ({78: "ВСМО «Сердце Пармы»"}, {"month": None}, {"city": None}),
    ({79: "ВСМО «Белогорье»"}, {"month": None}, {"city": None}),
    ({80: "ВСМО «Коллеги»"}, {"month": None}, {"city": None}),
    ({81: "ВСМО «Призвание»"}, {"month": None}, {"city": None}),
    ({82: "ВСМО «Клиника»"}, {"month": None}, {"city": None}),
    ({83: "ВСФО «36,6»"}, {"month": None}, {"city": None}),
    ({84: "ВСМО «Галиотис»"}, {"month": None}, {"city": None}),
    ({85: "ВСОП Екатеринбург"}, {"month": None}, {"city": None}),
    ({86: "ВСОП Нижний Новгород"}, {"month": None}, {"city": None}),
    ({87: "ВСОП Москва"}, {"month": None}, {"city": None}),
    ({88: "ВСОП Санкт-Петербург"}, {"month": None}, {"city": None}),
    ({89: "ВСПрО «Алабуга – Композит»"}, {"month": None}, {"city": None}),
    ({90: "ВПТОП «АлабугаТОП»"}, {"month": None}, {"city": None})
]

R7_DATA = [
    ({1: "Всероссийский слет студенческих отрядов образовательных организаций аграрного профиля Российской Федерации «Стударго»"}, {"month": "ноябрь"}, {"city": "Барнаул"}, {"is_labour_project": False}),
    ({2: "Всероссийский Слет студенческих отрядов"}, {"month": "ноябрь"}, {"city": "Казань"}, {"is_labour_project": False}),
    ({3: "Всероссийский конкурс профессионального мастерства «Труд крут» по девяти направлениям деятельности"}, {"month": "ноябрь"}, {"city": "Казань"}, {"is_labour_project": False}),
    ({4: "Всероссийская спартакиада студенческих отрядов"}, {"month": "ноябрь"}, {"city": "Казань"}, {"is_labour_project": False}),
    ({5: "Всероссийская профориентационная смена «Труд крут»"}, {"month": "ноябрь"}, {"city": "Анапа"}, {"is_labour_project": False}),
    ({6: "Профориентационный марафон «В Первые с РСО» (Конкурс «Гори своим делом»)"}, {"month": "декабрь"}, {"city": "онлайн"}, {"is_labour_project": False}),
    ({7: "Всероссийский медицинский карьерный форум «Труд крут»"}, {"month": "декабрь"}, {"city": "Южно-Сахалинск"}, {"is_labour_project": False}),
    ({8: "Конкурс среди образовательных организаций высшего образования на лучшую практику организации деятельности студенческих отрядов в системе образования 2023"}, {"month": None}, {"city": "онлайн"}, {"is_labour_project": False}),
    ({9: "Школа командиров и комиссаров студенческих отрядов железнодорожного транспорта"}, {"month": "март"}, {"city": "Иркутск"}, {"is_labour_project": False}),
    ({10: "Открытие Всероссийского летнего трудового семестра студенческих отрядов железнодорожного транспорта"}, {"month": "июнь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({11: "Всероссийский форум студенческих педагогических отрядов"}, {"month": "октябрь"}, {"city": "Севастополь"}, {"is_labour_project": False}),
    ({12: "ВСПрО «Арктика»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({13: "ВСПрО «КАМАЗ»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({14: "ВСС «Мирный атом»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({15: "ВСС «Мирный атом-ПРОРЫВ»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({16: "ВСС «Мирный атом-ЛАЭС»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({17: "ВСС «СКИФ»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({18: "ВСС «Север»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({19: "ВСС «Сибирь»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({20: "ВСС «БАМ 2.0»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({21: "ВСПО «Дельфин.ru»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({22: "ВСССхО «Агроном-сад»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({23: "ВССПуО «Край Света»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({24: "ВСССервО «Мрия»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({25: "ВСССервО «Метрополь»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({26: "ВСССервО «Сочи Парк Отель»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({27: "ВСССервО «Взлетная полоса»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({28: "ВСССервО «Последний рассвет»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({29: "ВСМО «Атлант»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({30: "ВСМО «Академия»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({31: "ВСМО «Аметист»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({32: "ВСМО «Сердце Пармы»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({33: "ВСМО «Белогорье»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({34: "ВСМО «Коллеги»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({35: "ВСМО «Призвание»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({36: "ВСМО «Клиника»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({37: "ВСФО «36,6»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({38: "ВСМО «Галиотис»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({39: "ВСОП Екатеринбург"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({40: "ВСОП Нижний Новгород"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({41: "ВСОП Москва"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({42: "ВСОП Санкт-Петербург"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({43: "ВСПрО «Алабуга – Композит»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({44: "ВПТОП «АлабугаТОП»"}, {"month": None}, {"city": None}, {"is_labour_project": True})
]

R9_EVENTS_NAMES = {
    1: "Снежный десант РСО",
    2: "Творческий фестиваль",
    3: "Спартакиада студенческих отрядов и комплекс мероприятий РСО-спорт",
    4: "Конкурс профессионального мастерства",
    5: "День РСО",
    6: "Региональная школа подготовки командиров и комиссаров РСО",
    7: "Открытие трудового семестра",
    8: "Закрытие трудового семестра",
    9: "Окружная школа руководителей штабов студенческих отрядов образовательных организаций",
    10: "Всероссийская акция «Вожатский диктант»",
    11: "Алгоритмы роста"
}

CONVERT_TO_MB = 1024 * 1024
ROUND_2_SIGNS = 2


# Письма
EMAIL_REPORT_PART_1_MESSAGE = '''Уважаемое региональное отделение,

Конкурсная комиссия Центрального штаба Российских студенческих отрядов приняла первую часть вашего отчета по деятельности РСО за 2024 год. Благодарим вас за проделанную работу!

Для вашего удобства во вложении к письму прикреплен PDF-файл с отправленными данными.

Если возникнут технические вопросы, вы всегда можете обратиться в службу поддержки сайта (https://t.me/LK_RSO_Support).

С уважением,
команда сайта лк.трудкрут.рф
'''
EMAIL_REPORT_PART_2_MESSAGE = '''Уважаемое региональное отделение,

Конкурсная комиссия Центрального штаба Российских студенческих отрядов приняла вторую часть вашего отчета по деятельности РСО за 2024 год. Благодарим вас за проделанную работу!

Для вашего удобства во вложении к письму прикреплен PDF-файл с отправленными данными.

Если возникнут технические вопросы, вы всегда можете обратиться в службу поддержки сайта (https://t.me/LK_RSO_Support).

С уважением,
команда сайта лк.трудкрут.рф
'''
EMAIL_REPORT_DECLINED_MESSAGE = '''Уважаемое региональное отделение, 

Конкурсная комиссия Центрального штаба Российских студенческих отрядов внесла комментарии по вашим показателям. Просим внести корректировки и отправить их повторно. 

Для внесения правок используйте форму подачи второй части отчетности на сайте лк.трудкрут.рф. В случае возникновения сложностей вы можете обратиться в службу поддержки сайта ( (https://t.me/LK_RSO_Support).

С уважением, 
команда сайта лк.трудкрут.рф
'''

MASS_REPORT_NUMBERS = ['6', '7', '9']

MSK_ID = 62
SPB_ID = 32

# TODO: Здесь рандомные цифры. Запросить значения из ЦШ перед мерджем в мастер.
ro_members_in_rso_vk = {
    1: 5764, 2: 5667, 3: 69, 4: 5360, 5: 191, 6: 1701, 7: 1861, 8: 347,
    9: 2163, 10: 2109, 11: 7134, 12: 356, 13: 2513, 14: 2202, 15: 3052,
    16: 6127, 17: 1541, 18: 1383, 19: 690, 20: 5647, 21: 1698, 22: 1999,
    23: 726, 24: 4963, 25: 1759, 26: 1055, 27: 2308, 28: 3614, 29: 4354,
    30: 2806, 31: 4126, 32: 2662, 33: 2813, 34: 3386, 35: 6996, 36: 2797,
    37: 4232, 38: 708, 39: 2549, 40: 1277, 41: 4192, 42: 4663, 43: 500,
    44: 2854, 45: 6351, 46: 2418, 47: 6326, 48: 1615, 49: 3729, 50: 133,
    51: 1477, 52: 3706, 53: 4501, 54: 1710, 55: 5403, 56: 3542, 57: 5442,
    58: 1380, 59: 4, 60: 2017, 61: 6337, 62: 539, 63: 3251, 64: 4507,
    65: 4789, 66: 5588, 67: 4363, 68: 2989, 69: 4701, 70: 4932, 71: 3289,
    72: 2698, 73: 717, 74: 6529, 75: 6240, 76: 300, 77: 1315, 78: 313,
    79: 3221, 80: 3702, 81: 6479, 82: 4767, 83: 5784, 84: 6897, 85: 3510,
    86: 2310, 87: 2551, 88: 2639, 89: 6, 90: 5845, 91: 2497, 92: 3670
}
