STATISTICAL_REPORT_EXISTS_MESSAGE = 'Статистический отчет для данного РШ уже существует'
REPORT_EXISTS_MESSAGE = 'Отчет для данного показателя уже существует'
REPORT_SENT_MESSAGE = 'Нельзя редактировать отправленный на верификацию отчет'

# Должности экспертов
DISTRICT_EXPERT_POSITION = 'Эксперт ОШ'
CENTRAL_EXPERT_POSITION = 'Эксперт ЦШ'

R6_DATA = [
    ({1: "ВСПрО «Арктика»"}, {"month": "январь"}, {"city": "Москва"}),
    ({2: "ВСПрО «КАМАЗ»"}, {"month": "январь"}, {"city": "Москва"}),
    ({3: "ВСС «Мирный атом»"}, {"month": "февраль"}, {"city": "Санкт-Петербург"}),
    ({4: "ВСС «Мирный атом-ПРОРЫВ»"}, {"month": "март"}, {"city": "Москва"}),
    ({5: "ВСС «Мирный атом-ЛАЭС»"}, {"month": "апрель"}, {"city": "Санкт-Петербург"}),
    ({6: "ВСС «СКИФ»"}, {"month": "май"}, {"city": "Москва"}),
    ({7: "ВСС «Север»"}, {"month": "июнь"}, {"city": "Санкт-Петербург"}),
    ({8: "ВСС «Сибирь»"}, {"month": "июль"}, {"city": "Новосибирск"}),
    ({9: "ВСС «БАМ 2.0»"}, {"month": "август"}, {"city": "Москва"}),
    ({10: "ВСПО «Артек»"}, {"month": "сентябрь"}, {"city": "Крым"}),
    ({11: "ВСПО «Дельфин.ru»"}, {"month": "октябрь"}, {"city": "Москва"}),
    ({12: "ВСПО «Гагарин»"}, {"month": "ноябрь"}, {"city": "Санкт-Петербург"}),
    ({13: "ВСПО «Океан»"}, {"month": "декабрь"}, {"city": "Москва"}),
    ({14: "ВСПО «Орлёнок»"}, {"month": "январь"}, {"city": "Крым"}),
    ({15: "ВСПО «Сириус»"}, {"month": "февраль"}, {"city": "Сочи"}),
    ({16: "ВСССхО «Агроном-сад»"}, {"month": "март"}, {"city": "Москва"}),
    ({17: "ВССхО «МоСт» (Молочный стандарт)"}, {"month": "апрель"}, {"city": "Санкт-Петербург"}),
    ({18: "ВССПуО «Край Света»"}, {"month": "май"}, {"city": "Москва"}),
    ({19: "ВСССервО «Мрия»"}, {"month": "июнь"}, {"city": "Санкт-Петербург"}),
    ({20: "ВСССервО «Метрополь»"}, {"month": "июль"}, {"city": "Москва"}),
    ({21: "ВСССервО «Сочи Парк Отель»"}, {"month": "август"}, {"city": "Сочи"}),
    ({22: "ВСССервО «Взлетная полоса»"}, {"month": "сентябрь"}, {"city": "Москва"}),
    ({23: "ВСМО «Атлант»"}, {"month": "октябрь"}, {"city": "Санкт-Петербург"}),
    ({24: "ВСМО «Академия»"}, {"month": "ноябрь"}, {"city": "Москва"}),
    ({25: "ВСМО «Аметист»"}, {"month": "декабрь"}, {"city": "Санкт-Петербург"}),
    ({26: "ВСМО «Сердце Пармы»"}, {"month": "январь"}, {"city": "Москва"}),
    ({27: "ВСМО «Белогорье»"}, {"month": "февраль"}, {"city": "Санкт-Петербург"}),
    ({28: "ВСМО «Коллеги»"}, {"month": "март"}, {"city": "Москва"}),
    ({29: "ВСМО «Призвание»"}, {"month": "апрель"}, {"city": "Санкт-Петербург"}),
    ({30: "ВСМО «Клиника»"}, {"month": "май"}, {"city": "Москва"}),
    ({31: "ВСФО «36,6»"}, {"month": "июнь"}, {"city": "Санкт-Петербург"}),
    ({32: "ВСМО «Галиотис»"}, {"month": "июль"}, {"city": "Москва"}),
    ({33: "ВСОП Екатеринбург"}, {"month": "август"}, {"city": "Екатеринбург"}),
    ({34: "ВСОП Нижний Новгород"}, {"month": "сентябрь"}, {"city": "Нижний Новгород"}),
    ({35: "ВСОП Москва"}, {"month": "октябрь"}, {"city": "Москва"}),
    ({36: "ВСОП Санкт-Петербург"}, {"month": "ноябрь"}, {"city": "Санкт-Петербург"})
]
R7_DATA = [
    ({1: "Мероприятие 1"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({2: "Мероприятие 2"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({3: "Мероприятие 3"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({4: "Мероприятие 4"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({5: "Мероприятие 5"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({6: "Мероприятие 6"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({7: "Мероприятие 7"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({8: "Мероприятие 8"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({9: "Мероприятие 9"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({10: "Мероприятие 10"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({11: "Мероприятие 11"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({12: "Мероприятие 12"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({13: "Мероприятие 13"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({14: "Мероприятие 14"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({15: "Мероприятие 15"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({16: "Мероприятие 16"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({17: "Мероприятие 17"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({18: "Мероприятие 18"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({19: "Мероприятие 19"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({20: "Мероприятие 20"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({21: "Мероприятие 21"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({22: "Мероприятие 22"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({23: "Мероприятие 23"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({24: "Мероприятие 24"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({25: "Мероприятие 25"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({26: "Мероприятие 26"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({27: "Мероприятие 27"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({28: "Мероприятие 28"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({29: "Мероприятие 29"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({30: "Мероприятие 30"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({31: "Мероприятие 31"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({32: "Мероприятие 32"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({33: "Мероприятие 33"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({34: "Мероприятие 34"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
    ({35: "Мероприятие 35"}, {"month": "январь"}, {"city": "Москва"}, {"is_labour_project": False}),
]

R9_EVENTS_NAMES = {
    1: "Снежный десант РСО",
    2: "Творческий фестиваль",
    3: "Спартакиада студенческих отрядов и комплекс мероприятий РСО-спорт",
    4: "Конкурс профессионального мастерства",
    5: "День РСО",
    6: "Региональная школа подготовки командиров и комиссаров РСО",
    7: "Открытие трудового семестра",
    8: "Закрытие трудового семестра",
    9: "Окружная школа руководителей штабов студенческих отрядов образовательных организаций",
    10: "Всероссийская акция «Вожатский диктант»",
    11: "Алгоритмы роста"
}

CONVERT_TO_MB = 1024 * 1024
ROUND_2_SIGNS = 2


# Письма
EMAIL_REPORT_PART_1_MESSAGE = '''Уважаемое региональное отделение,

Конкурсная комиссия Центрального штаба Российских студенческих отрядов приняла первую часть вашего отчета по деятельности РСО за 2024 год. Благодарим вас за проделанную работу!

Для вашего удобства во вложении к письму прикреплен PDF-файл с отправленными данными.

Если возникнут технические вопросы, вы всегда можете обратиться в службу поддержки сайта (https://t.me/LK_RSO_Support).

С уважением,
команда сайта лк.трудкрут.рф
'''
EMAIL_REPORT_PART_2_MESSAGE = '''Уважаемое региональное отделение,

Конкурсная комиссия Центрального штаба Российских студенческих отрядов приняла вторую часть вашего отчета по деятельности РСО за 2024 год. Благодарим вас за проделанную работу!

Для вашего удобства во вложении к письму прикреплен PDF-файл с отправленными данными.

Если возникнут технические вопросы, вы всегда можете обратиться в службу поддержки сайта (https://t.me/LK_RSO_Support).

С уважением,
команда сайта лк.трудкрут.рф
'''
EMAIL_REPORT_DECLINED_MESSAGE = '''Уважаемое региональное отделение, 

Конкурсная комиссия Центрального штаба Российских студенческих отрядов внесла комментарии по вашим показателям. Просим внести корректировки и отправить их повторно. 

Для внесения правок используйте форму подачи второй части отчетности на сайте лк.трудкрут.рф. В случае возникновения сложностей вы можете обратиться в службу поддержки сайта ( (https://t.me/LK_RSO_Support).

С уважением, 
команда сайта лк.трудкрут.рф
'''

MASS_REPORT_NUMBERS = ['6', '7', '9']

MSK_ID = 62
SPB_ID = 32
