STATISTICAL_REPORT_EXISTS_MESSAGE = 'Статистический отчет для данного РШ уже существует'
REPORT_EXISTS_MESSAGE = 'Отчет для данного показателя уже существует'
REPORT_SENT_MESSAGE = 'Нельзя редактировать отправленный на верификацию отчет'

R9_EVENTS_NAMES = {
    1: "Снежный десант РСО",
    2: "Творческий фестиваль",
    3: "Спартакиада студенческих отрядов и комплекс мероприятий РСО-спорт",
    4: "Конкурс профессионального мастерства",
    5: "День РСО",
    6: "Региональная школа подготовки командиров и комиссаров РСО",
    7: "Открытие трудового семестра",
    8: "Закрытие трудового семестра",
    9: "Окружная школа руководителей штабов студенческих отрядов образовательных организаций",
    10: "Всероссийская акция «Вожатский диктант»",
    11: "Алгоритмы роста"
}

CONVERT_TO_MB = 1024 * 1024
ROUND_2_SIGNS = 2
