STATISTICAL_REPORT_EXISTS_MESSAGE = 'Статистический отчет для данного РШ уже существует'
REPORT_EXISTS_MESSAGE = 'Отчет для данного показателя уже существует'
REPORT_SENT_MESSAGE = 'Нельзя редактировать отправленный на верификацию отчет'

# Должности экспертов
DISTRICT_EXPERT_POSITION = 'Эксперт ОШ'
CENTRAL_EXPERT_POSITION = 'Эксперт ЦШ'

R6_DATA = [
    ({1: "Всероссийский фестиваль студенческой молодежи «Сельскохозяйственный вектор страны»"}, {"month": "20 ‒ 22 октября 2023 г."}, {"city": "Республика Крым"}),
    ({2: "Образовательный семинар для вожатых студенческих педагогических отрядов"}, {"month": "22 ‒ 24 октября 2023 г."}, {"city": "Пятигорск"}),
    ({3: "Всероссийский фестиваль студенческих отрядов транспортной отрасли «БАМ – твой второй путь!»"}, {"month": "25 ‒ 27 октября 2023 г."}, {"city": "Омск"}),
    ({4: "Всероссийский форум студенческих педагогических отрядов «Вожатская смена: новая высота!»"}, {"month": "27 ‒ 29 октября 2023 г."}, {"city": "Барнаул"}),
    ({5: "Всероссийская профориентационная смена «Труд крут»"}, {"month": "4 ‒ 17 ноября 2023 г."}, {"city": "Анапа"}),
    ({6: "Всероссийский Слет студенческих отрядов"}, {"month": "10 ‒ 12 ноября 2023 г."}, {"city": "Казань"}),
    ({7: "Всероссийский конкурс профессионального мастерства «Труд крут» по девяти направлениям деятельности"}, {"month": "10 ‒ 12 ноября 2023 г."}, {"city": "Казань"}),
    ({8: "Всероссийская спартакиада студенческих отрядов"}, {"month": "10 ‒ 12 ноября 2023 г."}, {"city": "Казань"}),
    ({9: "Всероссийский слет студенческих отрядов образовательных организаций аграрного профиля Российской Федерации «Студагро»"}, {"month": "15 ‒ 18 ноября 2023 г."}, {"city": "Барнаул"}),
    ({10: "Всероссийский слёт студенческих отрядов проводников"}, {"month": "22 ‒ 24 ноября 2023 г."}, {"city": "Новосибирск"}),
    ({11: "Всероссийский интенсив сервисного направления"}, {"month": "24 ‒ 26 ноября 2023 г."}, {"city": "Челябинск"}),
    ({12: "Всероссийский медицинский карьерный форум «Труд крут»"}, {"month": "7 ‒ 10 декабря 2023 г."}, {"city": "Южно-Сахалинск"}),
    ({13: "Всероссийская школа высшего командного состава Российских студенческих отрядов для комиссаров региональных отделений»"}, {"month": "11 ‒ 15 декабря 2023 г."}, {"city": "Москва"}),
    ({14: "Всероссийское совещание руководителей направлений студенческих отрядов проводников"}, {"month": "1 ‒ 2 февраля 2024 г."}, {"city": "Самара"}),
    ({15: "Карьерный форум «Труд крут»"}, {"month": "17 ‒ 18 февраля 2024 г."}, {"city": "Москва"}),
    ({16: "Всероссийский форум участников патриотической акции «Снежный десант РСО»"}, {"month": "23 ‒ 25 февраля 2024 г."}, {"city": "Архангельск"}),
    ({17: "Всероссийское совещание руководителей направления производственных отрядов"}, {"month": "10 ‒ 12 марта 2024 г."}, {"city": "Республика Татарстан"}),
    ({18: "Школа инструкторов Всероссийского студенческого отряда проводников"}, {"month": "20 ‒ 22 марта 2024 г."}, {"city": "Иркутск"}),
    ({19: "Школа командиров и комиссаров студенческих отрядов железнодорожного транспорта"}, {"month": "20 ‒ 22 марта 2024 г."}, {"city": "Иркутск"}),
    ({20: "Всероссийское совещание руководителей региональных штабов МООО «РСО»"}, {"month": "22 ‒ 24 марта 2024 г."}, {"city": "Иркутск"}),
    ({21: "Школа методистов студенческих педагогических отрядов «СПОсобность к действию»"}, {"month": "22 ‒ 24 марта 2024 г."}, {"city": "Пермь"}),
    ({22: "Всероссийское совещание руководителей сервисного направления"}, {"month": "28 ‒ 31 марта 2024 г."}, {"city": "Великий Новгород"}),
    ({23: "Всероссийский медицинский карьерный форум «Труд крут»"}, {"month": "28 ‒ 31 марта 2024 г."}, {"city": "Пермь"}),
    ({24: "Всероссийское совещание руководителей направлений студенческих педагогических отрядов региональных отделений"}, {"month": "29 ‒ 31 марта 2024 г."}, {"city": "Самара"}),
    ({25: "Всероссийский форум студенческих строительных отрядов и Всероссийское совещание руководителей ССО"}, {"month": "29 ‒ 31 марта 2024 г."}, {"city": "Нижний Новгород"}),
    ({26: "Школа инструкторов Всероссийского студенческого отряда проводников"}, {"month": "29 ‒ 31 марта 2024 г."}, {"city": "Ижевск"}),
    ({27: "Всероссийский форум путинных отрядов"}, {"month": "29 марта ‒ 1 апреля 2024 г."}, {"city": "Южно-Сахалинск"}),
    ({28: "Всероссийское совещание для руководителей сельскохозяйственного направления региональных штабов РСО и руководителей штабов аграрных вузов России"}, {"month": "5 ‒ 7 апреля 2024 г."}, {"city": "Пермь"}),
    ({29: "Всероссийское совещание-обучение руководителей направления трудовых отрядов подростков"}, {"month": "5 ‒ 7 апреля 2024 г."}, {"city": "Пермь"}),
    ({30: "Всероссийский экологический форум студенческих отрядов «ЭкоТОП»"}, {"month": "12 ‒ 14 апреля 2024 г."}, {"city": "Республика Крым"}),
    ({31: "Всероссийская школа подготовки командных составов штабов Всероссийских трудовых проектов"}, {"month": "12 ‒ 28 апреля 2024 г."}, {"city": "Москва"}),
    ({32: "Торжественный этап Всероссийской акции   «Поклонимся великим тем годам» "}, {"month": "18 ‒ 20 апреля 2024 г."}, {"city": "Санкт-Петербург"}),
    ({33: "Интенсив Корпоративного университета РСО"}, {"month": "17 ‒ 19 мая 2024 г."}, {"city": "Московская область"}),
    ({34: "Всероссийский форум специализированных и производственных отрядов «Работа молодым»"}, {"month": "19 апреля 2024 г."}, {"city": "Республика Татарстан"}),
    ({35: "Проведение Всероссийского урока труда"}, {"month": "22 апреля 2024 г."}, {"city": "регионы"}),
    ({36: "Неделя охраны труда РСО"}, {"month": "22 ‒ 27 апреля 2024 г."}, {"city": "регионы"}),
    ({37: "Всероссийская школа подготовки руководителей региональных штабов студенческих отрядов – Вышка РСО"}, {"month": "22 ‒ 28 апреля 2024 г."}, {"city": "Москва"}),
    ({38: "Всероссийская школа по подготовке руководителей сервисных отрядов"}, {"month": "26 ‒ 28 апреля 2024 г."}, {"city": "Севастополь"}),
    ({39: "Тематическое шествие «Май! Труд крут!»"}, {"month": "1 мая 2024 г."}, {"city": "Москва"}),
    ({40: "Всероссийская трудовая акция «Труд крут»"}, {"month": "апрель ‒ май 2024 г."}, {"city": "регионы"}),
    ({41: "Торжественный этап Всероссийской акции  «Поклонимся великим тем годам» »"}, {"month": "18 - 20 апреля 2024 г."}, {"city": "Республика Крым"}),
    ({42: "Школа командиров и комиссаров студенческих строительных отрядов атомной отрасли"}, {"month": "27 ‒ 28 мая 2024 г."}, {"city": "Нижний Новгород"}),
    ({43: "Школа командиров и комиссаров студенческих отрядов электросетевого комплекса"}, {"month": "28 мая 2024 г."}, {"city": "онлайн"}),
    ({44: "Школа командиров и комиссаров студенческих отрядов публичного акционерного общества «Газпром»"}, {"month": "1 ‒ 2 июня 2024 г."}, {"city": "Санкт-Петербург"}),
    ({45: "Открытие Всероссийского летнего трудового семестра студенческих отрядов железнодорожного транспорта"}, {"month": "26 июня 2024 г."}, {"city": "Москва"}),
    ({46: "Всероссийское открытие трудового семестра студенческих медицинских отрядов МООО «РСО»"}, {"month": "15 июля 2024 г."}, {"city": "Москва"}),
    ({47: "II Всероссийский слет ветеранов студенческих отрядов"}, {"month": "26 ‒ 28 июля 2024 г."}, {"city": "Архангельск"}),
    ({48: "Всероссийский интенсив для руководителей региональных отделений Российских студенческих отрядов"}, {"month": "12 ‒ 14 сентября 2024 г."}, {"city": "Нижнекамск"}),
    ({49: "Всероссийский слет трудовых отрядов подростков"}, {"month": "5 ‒ 8 сентября 2024 г."}, {"city": "Архангельск"}),
    ({50: "Всероссийская медиашкола Российских студенческих отрядов"}, {"month": "5 ‒ 9 сентября 2024 г."}, {"city": "Красноярск"}),
    ({51: "Всероссийская медиашкола Российских студенческих отрядов"}, {"month": "13 ‒ 15 сентября 2024 г."}, {"city": "Московская область"}),
    ({52: "Всероссийский слет студенческих отрядов нефтедобывающей отрасли"}, {"month": "20 ‒ 22 сентября 2024 г."}, {"city": "Альметьевск"}),
    ({53: "Всероссийский слет студенческих медицинских отрядов «Всегда 20»"}, {"month": "20 ‒ 26 сентября 2024 г."}, {"city": "Томск"}),
    ({54: "Всероссийский конкурс профессионального мастерства «Труд крут» в направлении СПрО"}, {"month": "26 ‒ 29 сентября 2024 г."}, {"city": "Республика Татарстан"}),
    ({55: "Слёт студенческих отрядов ПАО «Газпром»"}, {"month": "2 ‒ 5 октября 2024 г."}, {"city": "Екатеринбург"}),
    ({56: "Всероссийский форум студенческих педагогических отрядов"}, {"month": "4 ‒ 6 октября 2024 г."}, {"city": "Севастополь"}),
    ({57: "Торжественный этап Всероссийской акции  «Поклонимся великим тем годам» »"}, {"month": "6 ‒ 8 октября 2024 г."}, {"city": "Челябинск"}),
    ({58: "Всероссийская научная конференция студенческих отрядов, посвященная 65-летию движения студенческих отрядов"}, {"month": "4 - 6 октября 2024 г."}, {"city": "Ростов-на-Дону"}),
    ({59: "ВСПрО «Арктика»"}, {"month": None}, {"city": None}),
    ({60: "ВСПрО «КАМАЗ»"}, {"month": None}, {"city": None}),
    ({61: "ВСПрО «Алабуга – Композит»"}, {"month": None}, {"city": None}),
    ({62: "ВСС «Мирный атом»"}, {"month": None}, {"city": None}),
    ({63: "ВСС «Мирный атом – ПРОРЫВ»"}, {"month": None}, {"city": None}),
    ({64: "ВСС «Мирный атом – ЛАЭС»"}, {"month": None}, {"city": None}),
    ({65: "ВСС «СКИФ»"}, {"month": None}, {"city": None}),
    ({66: "ВСС «Север»"}, {"month": None}, {"city": None}),
    ({67: "ВСС «Сибирь»"}, {"month": None}, {"city": None}),
    ({68: "ВСС «БАМ 2.0»"}, {"month": None}, {"city": None}),
    ({69: "ВСПО «Артек»"}, {"month": None}, {"city": None}),
    ({70: "ВСПО «Дельфин.ru»"}, {"month": None}, {"city": None}),
    ({71: "ВСПО «Гагарин»"}, {"month": None}, {"city": None}),
    ({72: "ВСПО «Океан»"}, {"month": None}, {"city": None}),
    ({73: "ВСПО «Орлёнок»"}, {"month": None}, {"city": None}),
    ({74: "ВСПО «Сириус»"}, {"month": None}, {"city": None}),
    ({75: "ВСССхО «Агроном-сад»"}, {"month": None}, {"city": None}),
    ({76: "ВССхО «МоСт» (Молочный стандарт)"}, {"month": None}, {"city": None}),
    ({77: "ВССПуО «Край Света»"}, {"month": None}, {"city": None}),
    ({78: "ВСССервО «Мрия»"}, {"month": None}, {"city": None}),
    ({79: "ВСССервО «Метрополь»"}, {"month": None}, {"city": None}),
    ({80: "ВСССервО «Сочи Парк Отель»"}, {"month": None}, {"city": None}),
    ({81: "ВСССервО «Взлетная полоса»"}, {"month": None}, {"city": None}),
    ({82: "ВСССервО «Первый рассвет»"}, {"month": None}, {"city": None}),
    ({83: "ВСМО «Атлант»"}, {"month": None}, {"city": None}),
    ({84: "ВСМО «Академия»"}, {"month": None}, {"city": None}),
    ({85: "ВСМО «Аметист»"}, {"month": None}, {"city": None}),
    ({86: "ВСМО «Сердце Пармы»"}, {"month": None}, {"city": None}),
    ({87: "ВСМО «Белогорье»"}, {"month": None}, {"city": None}),
    ({88: "ВСМО «Коллеги»"}, {"month": None}, {"city": None}),
    ({89: "ВСМО «Призвание»"}, {"month": None}, {"city": None}),
    ({90: "ВСМО «Клиника»"}, {"month": None}, {"city": None}),
    ({91: "ВСФО «36,6»"}, {"month": None}, {"city": None}),
    ({92: "ВСМО «Галиотис»"}, {"month": None}, {"city": None}),
    ({93: "ВСОП Екатеринбург"}, {"month": None}, {"city": None}),
    ({94: "ВСОП Нижний Новгород"}, {"month": None}, {"city": None}),
    ({95: "ВСОП Москва"}, {"month": None}, {"city": None}),
    ({96: "ВСОП Санкт-Петербург"}, {"month": None}, {"city": None}),
    ({97: "ВПТОП «АлабугаТОП»"}, {"month": None}, {"city": None})
]

R7_DATA = [
    ({1: "Всероссийский слет студенческих отрядов образовательных организаций аграрного профиля Российской Федерации «Стударго»"}, {"month": "15 ‒ 18 ноября 2023 г."}, {"city": "Барнаул"}, {"is_labour_project": False}),
    ({2: "Всероссийский Слет студенческих отрядов"}, {"month": "10 ‒ 12 ноября 2023 г."}, {"city": "Казань"}, {"is_labour_project": False}),
    ({3: "Всероссийский конкурс профессионального мастерства «Труд крут» по девяти направлениям деятельности"}, {"month": "10 ‒ 12 ноября 2023 г."}, {"city": "Казань"}, {"is_labour_project": False}),
    ({4: "Всероссийская спартакиада студенческих отрядов"}, {"month": "10 ‒ 12 ноября 2023 г."}, {"city": "Казань"}, {"is_labour_project": False}),
    ({5: "Всероссийская профориентационная смена  «Труд крут»"}, {"month": "4 ‒ 17 ноября 2023 г."}, {"city": "Анапа"}, {"is_labour_project": False}),
    ({6: "Профориентационный марафон «В Первые с РСО» (Конкурс «Гори своим делом»)"}, {"month": "5 декабря 2023 г."}, {"city": "онлайн"}, {"is_labour_project": False}),
    ({7: "Всероссийский медицинский карьерный форум «Труд крут»"}, {"month": "7 ‒ 10 декабря 2023 г."}, {"city": "Южно-Сахалинск"}, {"is_labour_project": False}),
    ({8: "Конкурс среди образовательных организаций высшего образования на лучшую практику организации деятельности студенческих отрядов в системе образования 2023"}, {"month": None}, {"city": "онлайн"}, {"is_labour_project": False}),
    ({9: "Школа командиров и комиссаров студенческих отрядов железнодорожного транспорта"}, {"month": "20 ‒ 22 марта 2024 г."}, {"city": "Иркутск"}, {"is_labour_project": False}),
    ({10: "Открытие Всероссийского летнего трудового семестра студенческих отрядов железнодорожного транспорта"}, {"month": "26 июня 2024 г."}, {"city": "Москва"}, {"is_labour_project": False}),
    ({11: "Всероссийский конкурс профессионального мастерства «Труд крут» в направлении СПрО"}, {"month": "26 ‒ 29 сентября 2024 г."}, {"city": "Республика Татарстан"}, {"is_labour_project": False}),
    ({12: "Всероссийский форум студенческих педагогических отрядов"}, {"month": "4 ‒ 6 октября 2024 г."}, {"city": "Севастополь"}, {"is_labour_project": False}),
    ({13: "ВСПрО «Арктика»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({14: "ВСПрО «КАМАЗ»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({15: "ВСПрО «Алабуга – Композит»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({16: "ВСС «Мирный атом»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({17: "ВСС «Мирный атом – ПРОРЫВ»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({18: "ВСС «Мирный атом – ЛАЭС»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({19: "ВСС «СКИФ»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({20: "ВСС «Север»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({21: "ВСС «Сибирь»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({22: "ВСС «БАМ 2.0»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({23: "ВСПО «Дельфин.ru»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({24: "ВСССхО «Агроном-сад»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({25: "ВССПуО «Край Света»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({26: "ВСССервО «Мрия»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({27: "ВСССервО «Метрополь»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({28: "ВСССервО «Сочи Парк Отель»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({29: "ВСССервО «Взлетная полоса»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({30: "ВСССервО «Первый рассвет»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({31: "ВСМО «Атлант»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({32: "ВСМО «Академия»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({33: "ВСМО «Аметист»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({34: "ВСМО «Сердце Пармы»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({35: "ВСМО «Белогорье»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({36: "ВСМО «Коллеги»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({37: "ВСМО «Призвание»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({38: "ВСМО «Клиника»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({39: "ВСФО «36,6»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({40: "ВСМО «Галиотис»"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({41: "ВСОП Екатеринбург"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({42: "ВСОП Нижний Новгород"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({43: "ВСОП Москва"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({44: "ВСОП Санкт-Петербург"}, {"month": None}, {"city": None}, {"is_labour_project": True}),
    ({45: "ВПТОП «АлабугаТОП»"}, {"month": None}, {"city": None}, {"is_labour_project": True})
]

R9_EVENTS_NAMES = {
    1: "Снежный десант РСО",
    2: "Творческий фестиваль",
    3: "Спартакиада студенческих отрядов и комплекс мероприятий РСО-спорт",
    4: "Конкурс профессионального мастерства",
    5: "День РСО",
    6: "Региональная школа подготовки командиров и комиссаров РСО",
    7: "Открытие трудового семестра",
    8: "Закрытие трудового семестра",
    9: "Окружная школа руководителей штабов студенческих отрядов образовательных организаций",
    10: "Всероссийская акция «Вожатский диктант»",
    11: "Алгоритмы роста"
}

CONVERT_TO_MB = 1024 * 1024
ROUND_2_SIGNS = 2


# Письма
EMAIL_REPORT_PART_1_MESSAGE = '''Уважаемое региональное отделение,

Конкурсная комиссия Центрального штаба Российских студенческих отрядов приняла первую часть вашего отчета по деятельности РСО за 2024 год. Благодарим вас за проделанную работу!

Для вашего удобства во вложении к письму прикреплен PDF-файл с отправленными данными.

Если возникнут технические вопросы, вы всегда можете обратиться в службу поддержки сайта (https://t.me/LK_RSO_Support).

С уважением,
команда сайта лк.трудкрут.рф
'''
EMAIL_REPORT_PART_2_MESSAGE = '''Уважаемое региональное отделение,

Конкурсная комиссия Центрального штаба Российских студенческих отрядов приняла вторую часть вашего отчета по деятельности РСО за 2024 год. Благодарим вас за проделанную работу!

Для вашего удобства во вложении к письму прикреплен PDF-файл с отправленными данными.

Если возникнут технические вопросы, вы всегда можете обратиться в службу поддержки сайта (https://t.me/LK_RSO_Support).

С уважением,
команда сайта лк.трудкрут.рф
'''
EMAIL_REPORT_DECLINED_MESSAGE = '''Уважаемое региональное отделение, 

Конкурсная комиссия Центрального штаба Российских студенческих отрядов внесла комментарии по вашим показателям. Просим внести корректировки и отправить их повторно. 

Для внесения правок используйте форму подачи второй части отчетности на сайте лк.трудкрут.рф. В случае возникновения сложностей вы можете обратиться в службу поддержки сайта ( (https://t.me/LK_RSO_Support).

С уважением, 
команда сайта лк.трудкрут.рф
'''

MASS_REPORT_NUMBERS = ['6', '7', '9']

MSK_ID = 62
SPB_ID = 32

# TODO: Здесь рандомные цифры. Запросить значения из ЦШ перед мерджем в мастер.
ro_members_in_rso_vk = {
    1: 5764, 2: 5667, 3: 69, 4: 5360, 5: 191, 6: 1701, 7: 1861, 8: 347,
    9: 2163, 10: 2109, 11: 7134, 12: 356, 13: 2513, 14: 2202, 15: 3052,
    16: 6127, 17: 1541, 18: 1383, 19: 690, 20: 5647, 21: 1698, 22: 1999,
    23: 726, 24: 4963, 25: 1759, 26: 1055, 27: 2308, 28: 3614, 29: 4354,
    30: 2806, 31: 4126, 32: 2662, 33: 2813, 34: 3386, 35: 6996, 36: 2797,
    37: 4232, 38: 708, 39: 2549, 40: 1277, 41: 4192, 42: 4663, 43: 500,
    44: 2854, 45: 6351, 46: 2418, 47: 6326, 48: 1615, 49: 3729, 50: 133,
    51: 1477, 52: 3706, 53: 4501, 54: 1710, 55: 5403, 56: 3542, 57: 5442,
    58: 1380, 59: 4, 60: 2017, 61: 6337, 62: 539, 63: 3251, 64: 4507,
    65: 4789, 66: 5588, 67: 4363, 68: 2989, 69: 4701, 70: 4932, 71: 3289,
    72: 2698, 73: 717, 74: 6529, 75: 6240, 76: 300, 77: 1315, 78: 313,
    79: 3221, 80: 3702, 81: 6479, 82: 4767, 83: 5784, 84: 6897, 85: 3510,
    86: 2310, 87: 2551, 88: 2639, 89: 6, 90: 5845, 91: 2497, 92: 3670
}
