STATISTICAL_REPORT_EXISTS_MESSAGE = 'Статистический отчет для данного РШ уже существует'
REPORT_EXISTS_MESSAGE = 'Отчет для данного показателя уже существует'
REPORT_SENT_MESSAGE = 'Нельзя редактировать отправленный на верификацию отчет'

# Должности экспертов
DISTRICT_EXPERT_POSITION = 'Эксперт ОШ'
CENTRAL_EXPERT_POSITION = 'Эксперт ЦШ'

R6_DATA = [
    ({1: "Мероприятие 1"}, {"month": None}, {"city": None}),
    ({2: "Мероприятие 2"}, {"month": None}, {"city": None}),
    ({3: "Мероприятие 3"}, {"month": None}, {"city": None}),
    ({4: "Мероприятие 4"}, {"month": None}, {"city": None}),
    ({5: "Мероприятие 5"}, {"month": None}, {"city": None}),
    ({6: "Мероприятие 6"}, {"month": None}, {"city": None}),
    ({7: "Мероприятие 7"}, {"month": None}, {"city": None}),
    ({8: "Мероприятие 8"}, {"month": None}, {"city": None}),
    ({9: "Мероприятие 9"}, {"month": None}, {"city": None}),
    ({10: "Мероприятие 10"}, {"month": None}, {"city": None}),
    ({11: "Мероприятие 11"}, {"month": None}, {"city": None}),
    ({12: "Мероприятие 12"}, {"month": None}, {"city": None}),
    ({13: "Мероприятие 13"}, {"month": None}, {"city": None}),
    ({14: "Мероприятие 14"}, {"month": None}, {"city": None}),
    ({15: "Мероприятие 15"}, {"month": None}, {"city": None}),
    ({16: "Мероприятие 16"}, {"month": None}, {"city": None}),
    ({17: "Мероприятие 17"}, {"month": None}, {"city": None}),
    ({18: "Мероприятие 18"}, {"month": None}, {"city": None}),
    ({19: "Мероприятие 19"}, {"month": None}, {"city": None}),
    ({20: "Мероприятие 20"}, {"month": None}, {"city": None}),
    ({21: "Мероприятие 21"}, {"month": None}, {"city": None}),
    ({22: "Мероприятие 22"}, {"month": None}, {"city": None}),
    ({23: "Мероприятие 23"}, {"month": None}, {"city": None}),
    ({24: "Мероприятие 24"}, {"month": None}, {"city": None}),
    ({25: "Мероприятие 25"}, {"month": None}, {"city": None}),
    ({26: "Мероприятие 26"}, {"month": None}, {"city": None}),
    ({27: "Мероприятие 27"}, {"month": None}, {"city": None}),
    ({28: "Мероприятие 28"}, {"month": None}, {"city": None}),
    ({29: "Мероприятие 29"}, {"month": None}, {"city": None}),
    ({30: "Мероприятие 30"}, {"month": None}, {"city": None}),
    ({31: "Мероприятие 31"}, {"month": None}, {"city": None}),
    ({32: "Мероприятие 32"}, {"month": None}, {"city": None}),
    ({33: "Мероприятие 33"}, {"month": None}, {"city": None}),
    ({34: "Мероприятие 34"}, {"month": None}, {"city": None}),
    ({35: "Мероприятие 35"}, {"month": None}, {"city": None}),
    ({36: "Мероприятие 36"}, {"month": None}, {"city": None}),
    ({37: "Мероприятие 37"}, {"month": None}, {"city": None}),
    ({38: "Мероприятие 38"}, {"month": None}, {"city": None}),
    ({39: "Мероприятие 39"}, {"month": None}, {"city": None}),
    ({40: "Мероприятие 40"}, {"month": None}, {"city": None}),
    ({41: "Мероприятие 41"}, {"month": None}, {"city": None}),
    ({42: "Мероприятие 42"}, {"month": None}, {"city": None}),
    ({43: "Мероприятие 43"}, {"month": None}, {"city": None}),
    ({44: "Мероприятие 44"}, {"month": None}, {"city": None}),
    ({45: "Мероприятие 45"}, {"month": None}, {"city": None}),
    ({46: "Мероприятие 46"}, {"month": None}, {"city": None}),
    ({47: "Мероприятие 47"}, {"month": None}, {"city": None}),
    ({48: "Мероприятие 48"}, {"month": None}, {"city": None}),
    ({49: "Мероприятие 49"}, {"month": None}, {"city": None}),
    ({50: "Мероприятие 50"}, {"month": None}, {"city": None}),
    ({51: "Мероприятие 51"}, {"month": None}, {"city": None}),
    ({52: "Мероприятие 52"}, {"month": None}, {"city": None}),
    ({53: "Мероприятие 53"}, {"month": None}, {"city": None}),
    ({54: "Мероприятие 54"}, {"month": None}, {"city": None}),
    ({55: "Мероприятие 55"}, {"month": None}, {"city": None}),
    ({56: "Мероприятие 56"}, {"month": None}, {"city": None}),
    ({57: "Мероприятие 57"}, {"month": None}, {"city": None}),
    ({58: "Мероприятие 58"}, {"month": None}, {"city": None}),
    ({59: "Мероприятие 59"}, {"month": None}, {"city": None}),
    ({60: "Мероприятие 60"}, {"month": None}, {"city": None}),
    ({61: "Мероприятие 61"}, {"month": None}, {"city": None}),
    ({62: "Мероприятие 62"}, {"month": None}, {"city": None}),
    ({63: "Мероприятие 63"}, {"month": None}, {"city": None}),
    ({64: "Мероприятие 64"}, {"month": None}, {"city": None}),
    ({65: "Мероприятие 65"}, {"month": None}, {"city": None}),
    ({66: "Мероприятие 66"}, {"month": None}, {"city": None}),
    ({67: "Мероприятие 67"}, {"month": None}, {"city": None}),
    ({68: "Мероприятие 68"}, {"month": None}, {"city": None}),
    ({69: "Мероприятие 69"}, {"month": None}, {"city": None}),
    ({70: "Мероприятие 70"}, {"month": None}, {"city": None}),
    ({71: "Мероприятие 71"}, {"month": None}, {"city": None}),
    ({72: "Мероприятие 72"}, {"month": None}, {"city": None}),
    ({73: "Мероприятие 73"}, {"month": None}, {"city": None}),
    ({74: "Мероприятие 74"}, {"month": None}, {"city": None}),
    ({75: "Мероприятие 75"}, {"month": None}, {"city": None}),
    ({76: "Мероприятие 76"}, {"month": None}, {"city": None}),
    ({77: "Мероприятие 77"}, {"month": None}, {"city": None}),
    ({78: "Мероприятие 78"}, {"month": None}, {"city": None}),
    ({79: "Мероприятие 79"}, {"month": None}, {"city": None}),
    ({80: "Мероприятие 80"}, {"month": None}, {"city": None}),
    ({81: "Мероприятие 81"}, {"month": None}, {"city": None}),
    ({82: "Мероприятие 82"}, {"month": None}, {"city": None}),
    ({83: "Мероприятие 83"}, {"month": None}, {"city": None}),
    ({84: "Мероприятие 84"}, {"month": None}, {"city": None}),
    ({85: "Мероприятие 85"}, {"month": None}, {"city": None}),
    ({86: "Мероприятие 86"}, {"month": None}, {"city": None}),
    ({87: "Мероприятие 87"}, {"month": None}, {"city": None}),
    ({88: "Мероприятие 88"}, {"month": None}, {"city": None}),
    ({89: "Мероприятие 89"}, {"month": None}, {"city": None}),
    ({90: "Мероприятие 90"}, {"month": None}, {"city": None})
]


R9_EVENTS_NAMES = {
    1: "Творческий фестиваль (организация мероприятия)",
    2: "Спартакиада студенческих отрядов и участие в комплексе мероприятий РСО-спорт (организация мероприятия, в случае проведения)",
    3: "Конкурс профессионального мастерства (по любому из направлений деятельности РСО)",
    4: "День РСО / Карьерный форум (организация мероприятия)",
    5: "Региональная школа подготовки командиров и комиссаров РСО (организация мероприятия)",
    6: "Открытие трудового семестра (организация мероприятия)",
    7: "Закрытие трудового семестра (организация мероприятия)",
    8: "Всероссийская неделя охраны труда РСО (организация мероприятия)",
    9: "Всероссийский урок труда (организация мероприятия)",
    10: "Всероссийская трудовая акция «ТрудКрут» или организация шествия 1 Мая в субъекте РФ (организация мероприятия)"
}

CONVERT_TO_MB = 1024 * 1024
ROUND_2_SIGNS = 2


# Письма
EMAIL_REPORT_PART_1_MESSAGE = '''Уважаемое региональное отделение,

Конкурсная комиссия Центрального штаба Российских студенческих отрядов приняла первую часть вашего отчета по деятельности РСО за 2024 год. Благодарим вас за проделанную работу!

Для вашего удобства во вложении к письму прикреплен PDF-файл с отправленными данными.

Если возникнут технические вопросы, вы всегда можете обратиться в службу поддержки сайта (https://t.me/LK_RSO_Support).

С уважением,
команда сайта лк.трудкрут.рф
'''
EMAIL_REPORT_PART_2_MESSAGE = '''Уважаемое региональное отделение,

Конкурсная комиссия Центрального штаба Российских студенческих отрядов приняла вторую часть вашего отчета по деятельности РСО за 2024 год. Благодарим вас за проделанную работу!

Для вашего удобства во вложении к письму прикреплен PDF-файл с отправленными данными.

Если возникнут технические вопросы, вы всегда можете обратиться в службу поддержки сайта (https://t.me/LK_RSO_Support).

С уважением,
команда сайта лк.трудкрут.рф
'''
EMAIL_REPORT_DECLINED_MESSAGE = '''Уважаемое региональное отделение,

Конкурсная комиссия Центрального штаба Российских студенческих отрядов внесла комментарии по вашим показателям. Просим внести корректировки и отправить их повторно.

Для внесения правок используйте форму подачи второй части отчетности на сайте лк.трудкрут.рф. В случае возникновения сложностей вы можете обратиться в службу поддержки сайта (https://t.me/LK_RSO_Support).

С уважением,
команда сайта лк.трудкрут.рф
'''

MASS_REPORT_NUMBERS = ['6', '9']

MSK_ID = 62
SPB_ID = 32

ro_members_in_rso_vk = {
    1: 2795, 2: 1539, 3: 12723, 6: 969, 7: 658, 8: 2122, 9: 1653, 10: 944, 11: 978, 12: 536, 13: 658, 15: 4709,
    16: 1238, 17: 3315, 19: 2284, 20: 2017, 21: 5101, 22: 24370, 23: 1957, 24: 1740, 25: 4179, 26: 805, 27: 2596,
    28: 11340, 29: 435, 30: 821, 31: 683, 32: 535, 33: 875, 34: 983, 35: 491, 36: 827, 37: 3370, 38: 507, 39: 474,
    40: 520, 41: 1481, 42: 1501, 43: 642, 44: 1312, 45: 11560, 46: 1381, 47: 5288, 48: 17246, 49: 8736, 50: 305,
    51: 354, 52: 953, 53: 719, 54: 1026, 55: 1097, 56: 718, 57: 22476, 58: 549, 59: 2219, 60: 381, 61: 236, 62: 2899,
    63: 245, 64: 354, 65: 286, 66: 451, 68: 8430, 69: 194, 70: 250, 71: 103, 72: 784, 73: 352, 74: 446, 75: 759,
    76: 711, 77: 1428, 78: 613, 79: 456, 80: 12661, 81: 7586, 82: 1031, 83: 698, 84: 1252, 85: 1172, 86: 2329, 87: 207,
}

MEDIA_PATH = 'https://лк.трудкрут.рф/media/'

MEMBER_FEE = 50
